In [2]:
import numpy as np

In [22]:
x = np.array([[1,2,3]])
print("shape=",x.shape,"dimension=",x.ndim)

shape= (1, 3) dimension= 2

In [21]:
y = np.array([[4],[5]])
print("shape=",y.shape,"dimension=",y.ndim)

shape= (2, 1) dimension= 2

In [3]:
s = np.broadcast_arrays(x,y)
print(s)
print(x+y)
print(x*y)
#print(x+y)

NameError: name 'np' is not defined

                                   PANDAS

In [4]:
#pandass can have multiple data types
#pandas have two data structures
#series and dataframe

In [5]:
import pandas as pd

Pandas data structures 
####series###

In [9]:
# s1 is called pandas series object
s1 = pd.Series([11,22,33,44,55,66,77,88,99,110])
s1

0     11
1     22
2     33
3     44
4     55
5     66
6     77
7     88
8     99
9    110
dtype: int64

In [25]:
#index(0-9 default indext given by series object)
s1[8] #accessing value by indexx

99

In [39]:
s1[[2,4,6,7]] #accessing multiple values

2    33
4    55
6    77
7    88
dtype: int64

In [34]:
 # modifying a value in series object
s1[5] = 69
print(s1)
s1[[9,3,4,1]] = [222,111,44,666]
print(s1)

0     11
1     22
2     33
3     44
4     55
5     69
7     88
8     99
9    110
dtype: int64
0     11
1    666
2     33
3    111
4     44
5     69
7     88
8     99
9    222
dtype: int64

In [47]:
 del s1[9]#deleting any value from series object
print(s1)

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
dtype: int64

In [56]:
s1[99] = 999 #insert in a series with a new index
s1[89] = 40
s1

0      11
1      22
2      33
3      44
4      55
5      66
6      77
7      88
8      99
99    999
89     40
dtype: object

In [59]:
s2 = pd.Series([109,20,30,40,60], index=["oranges","apples","bananas","mangoes","kiwi"])
s2

oranges    109
apples      20
bananas     30
mangoes     40
kiwi        60
dtype: int64

In [61]:
print(s2.index)
print(s2.values)
print(s2["oranges"])

Index(['oranges', 'apples', 'bananas', 'mangoes', 'kiwi'], dtype='object')
[109  20  30  40  60]
109

In [ ]:
print(s2.index)
print(s2.values)
print(s2["oranges"])

In [62]:
s2>30

oranges     True
apples     False
bananas    False
mangoes     True
kiwi        True
dtype: bool

In [63]:
s2[s2>30]

oranges    109
mangoes     40
kiwi        60
dtype: int64

In [68]:
"peach" in s2
print("oranges" in s2)

True

In [70]:
#converting dictionaries to series
dict1 = {"ohio" : 7800, "texas" : 90, "California" : 900}
s3 = pd.Series(dict1)
print(dict1)
print(s3)
states = ["California", "Newyork", "utah"]

{'ohio': 7800, 'texas': 90, 'California': 900}
ohio          7800
texas           90
California     900
dtype: int64

In [76]:
states = ["California", "Newyork", "utah"]
data1 = pd.Series(dict1,index = states)
data1

California    900.0
Newyork         NaN
utah            NaN
dtype: float64

In [77]:
data1["Newyork"] = 6000
print(data1)

California     900.0
Newyork       6000.0
utah             NaN
dtype: float64

In [78]:
data1.notnull()

California     True
Newyork        True
utah          False
dtype: bool

In [80]:
data1.isnull()

California    False
Newyork       False
utah           True
dtype: bool

                      DataFrame

In [10]:
data = {'state': ["ohio","ohio","ohio","Nevada","Nevada","Nevada"],
        "year" : [2001,2002,2003,2001,2002,2003],
        "population": [20000,98889,87770,67000,98000,4500]}
df1 = pd.DataFrame(data)
df1

    state  year  population
0    ohio  2001       20000
1    ohio  2002       98889
2    ohio  2003       87770
3  Nevada  2001       67000
4  Nevada  2002       98000
5  Nevada  2003        4500

In [98]:
df1[["population","state"]]

   population   state
0       20000    ohio
1       98889    ohio
2       87770    ohio
3       67000  Nevada
4       98000  Nevada
5        4500  Nevada

In [87]:
type(df1)
shape.df

pandas.core.frame.DataFrame

In [104]:
del df1["state"]
print(df1)

   year  debt
0  2001   100
1  2002   100
2  2003   100
3  2001   100
4  2002   100
5  2003   100

In [102]:
#insert a new column
df1["debt"]= 100
df1

    state  year  debt
0    ohio  2001   100
1    ohio  2002   100
2    ohio  2003   100
3  Nevada  2001   100
4  Nevada  2002   100
5  Nevada  2003   100

In [106]:
df1["debt"]= range(6)

In [107]:
df1

   year  debt
0  2001     0
1  2002     1
2  2003     2
3  2001     3
4  2002     4
5  2003     5

In [108]:
df1["state"] = df1["year"]

In [109]:
df1

   year  debt  state
0  2001     0   2001
1  2002     1   2002
2  2003     2   2003
3  2001     3   2001
4  2002     4   2002
5  2003     5   2003

In [7]:
dic2 = {"names" : ["ayesha", "tara","aneeq","afifa","shabana","ariba"],
      "Aiforeveryone": [78,90,20,88,99,100],
      "Python1" : [90,78,65,43,98,100],
      "Python2": [66,70,98,76,65,75]}

In [8]:
dic2

{'names': ['ayesha', 'tara', 'aneeq', 'afifa', 'shabana', 'ariba'],
 'Aiforeveryone': [78, 90, 20, 88, 99, 100],
 'Python1': [90, 78, 65, 43, 98, 100],
 'Python2': [66, 70, 98, 76, 65, 75]}

In [9]:
df2 = pd.DataFrame(dic2,index=[1,2,3,4,5,6])
df2

     names  Aiforeveryone  Python1  Python2
1   ayesha             78       90       66
2     tara             90       78       70
3    aneeq             20       65       98
4    afifa             88       43       76
5  shabana             99       98       65
6    ariba            100      100       75

In [10]:
df2["total"] = df2["Aiforeveryone"] + df2["Python1"] + df2["Python2"] 
df2

     names  Aiforeveryone  Python1  Python2  total
1   ayesha             78       90       66    234
2     tara             90       78       70    238
3    aneeq             20       65       98    183
4    afifa             88       43       76    207
5  shabana             99       98       65    262
6    ariba            100      100       75    275

In [11]:
df2["status"]=["pass" if marks>=200 else "fail"for marks in df2.total]
df2

     names  Aiforeveryone  Python1  Python2  total status
1   ayesha             78       90       66    234   pass
2     tara             90       78       70    238   pass
3    aneeq             20       65       98    183   fail
4    afifa             88       43       76    207   pass
5  shabana             99       98       65    262   pass
6    ariba            100      100       75    275   pass

In [1]:
numbers = [1,2,3,4,5,6,7,8,9]
evenArr = []
oddArr = []
for num in numbers:
    if num%2==0:
        evenArr.append(num)
    else:
        oddArr.append(num)
        
print(evenArr)
print(oddArr)

[2, 4, 6, 8]
[1, 3, 5, 7, 9]

In [3]:
[num for num in numbers if num%2==0]

[2, 4, 6, 8]

In [26]:
df2["status"]=["pass" if a>=33 and p1>=33 and p2>=33 else "fail"
             for a,p1,p2 in zip(df2["Aiforeveryone"],df2["Python1"],df2["Python2"])]

In [27]:
df2

     names  Aiforeveryone  Python1  Python2  total status
1   ayesha             78       90       66    234   pass
2     tara             90       78       70    238   pass
3    aneeq             20       65       98    183   fail
4    afifa             88       43       76    207   pass
5  shabana             99       98       65    262   pass
6    ariba            100      100       75    275   pass

In [31]:
df2.head(3)

    names  Aiforeveryone  Python1  Python2  total status
1  ayesha             78       90       66    234   pass
2    tara             90       78       70    238   pass
3   aneeq             20       65       98    183   fail

In [32]:
df2.tail(2)

     names  Aiforeveryone  Python1  Python2  total status
5  shabana             99       98       65    262   pass
6    ariba            100      100       75    275   pass

In [35]:
df2.loc[5]

names            shabana
Aiforeveryone         99
Python1               98
Python2               65
total                262
status              pass
Name: 5, dtype: object

In [36]:
df2.iloc[4]

names            shabana
Aiforeveryone         99
Python1               98
Python2               65
total                262
status              pass
Name: 5, dtype: object

In [13]:
df2

     names  Aiforeveryone  Python1  Python2  total status
1   ayesha             78       90       66    234   pass
2     tara             90       78       70    238   pass
3    aneeq             20       65       98    183   fail
4    afifa             88       43       76    207   pass
5  shabana             99       98       65    262   pass
6    ariba            100      100       75    275   pass